pmo-dataset/variations/mermaid_with_ids/35.mmd
graph LR
	classDef endEvent stroke-width:3px
	User_1["Determine properties"]
	User_2["Check delivery of\nordered parts"]
	User_3["Perform Inspection"]
	User_4["Send first saw"]
	User_5["Cancel production of\nthe remaining order"]
	User_6["Send the remaining\norder"]
	Service_1["Order parts"]
	Service_2["Order parts"]
	Service_3["Order parts"]
	Service_4["Assemble the parts"]
	Service_5["Send updates"]
	Service_6["Produce the\nremaining order"]
	StartNoneEvent_1(("Start"))
	EndNoneEvent_1(("End")):::endEvent
	ExclusiveGateway_1{"Parts arrived ?"}
	ExclusiveGateway_2{"Customer Approval ?"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}

	StartNoneEvent_1 --> User_1
	User_1 --> ParallelGateway_1
	ParallelGateway_1 --> Service_1
	ParallelGateway_1 --> Service_2
	Service_1 --> ParallelGateway_2
	Service_2 --> ParallelGateway_2
	ParallelGateway_2 --> User_2
	User_2 --> ExclusiveGateway_1
	ExclusiveGateway_1 -->|"No"| User_2
	ExclusiveGateway_1 -->|"Yes"| User_3
	User_3 --> Service_4
	Service_4 --> Service_5
	Service_5 --> User_4
	User_4 --> ExclusiveGateway_2
	ExclusiveGateway_2 -->|"No"| User_5
	User_5 --> EndNoneEvent_1
	ExclusiveGateway_2 -->|"Yes"| Service_6
	Service_6 --> User_6
	User_6 --> EndNoneEvent_1
	ParallelGateway_1 --> Service_3
	Service_3 --> ParallelGateway_2
